OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/2d.c
/**************************************************************************//**
* @file     2d.c
* @version  V1.00
* $Revision: 3 $
* $Date: 15/07/08 11:02a $
* @brief    NUC970 GE2D driver source file
*
* @note
* Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "nuc970.h"
#include "sys.h"
#include "2d.h"

/** @addtogroup NUC970_Device_Driver NUC970 Device Driver
  @{
*/

/** @addtogroup NUC970_GE2D_Driver GE2D Driver
  @{
*/

/** @addtogroup NUC970_GE2D_EXPORTED_CONSTANTS GE2D Exported Constants
  @{
*/

/// @cond HIDDEN_SYMBOLS
static unsigned int GFX_BPP;
static unsigned int GFX_WIDTH;
static unsigned int GFX_HEIGHT;
static unsigned int GFX_PITCH;
static unsigned int GFX_SIZE;
#if defined ( __GNUC__ ) && !(__CC_ARM)
__attribute__((aligned(32))) static void *GFX_START_ADDR;
__attribute__((aligned(32))) static void *MONO_SOURCE_ADDR;
__attribute__((aligned(32))) static void *COLOR_SOURCE_ADDR;
__attribute__((aligned(32))) static void *CMODEL_START_ADDR;
__attribute__((aligned(32))) static void *GFX_OFFSCREEN_ADDR;
__attribute__((aligned(32))) static void *GFX_PAT_ADDR;
#else
static __align(32) void *GFX_START_ADDR;
static __align(32) void *MONO_SOURCE_ADDR;
static __align(32) void *COLOR_SOURCE_ADDR;
static __align(32) void *CMODEL_START_ADDR;
static __align(32) void *GFX_OFFSCREEN_ADDR;
static __align(32) void *GFX_PAT_ADDR;
#endif
static void *Orig_GFX_START_ADDR;
static void *Orig_MONO_SOURCE_ADDR;
static void *Orig_COLOR_SOURCE_ADDR;
static void *Orig_CMODEL_START_ADDR;
static void *Orig_GFX_OFFSCREEN_ADDR;
static void *Orig_GFX_PAT_ADDR;

#define  PN   1  // Quadrant 1
#define  NN   2  // Quadrant 2
#define  NP   3  // Quadrant 3
#define  PP   4  // Quadrant 4

#define ABS(x)      (((x)>0)?(x):-(x))
#define MAX(a,b)    (((a)>(b))?(a):(b))

/* octant code of line drawing */

#define XpYpXl      (0<<1)   // XY octant position is 1~3 in Control register
#define XpYpYl      (1<<1)
#define XpYmXl      (2<<1)
#define XpYmYl      (3<<1)
#define XmYpXl      (4<<1)
#define XmYpYl      (5<<1)
#define XmYmXl      (6<<1)
#define XmYmYl      (7<<1)

static MONOPATTERN MonoPatternData[6] = {
    {0x00000000, 0xff000000}, // HS_HORIZONTAL
    {0x08080808, 0x08080808}, // HS_VERTICAL
    {0x80402010, 0x08040201}, // HS_FDIAGONAL
    {0x01020408, 0x10204080}, // HS_BDIAGONAL
    {0x08080808, 0xff080808}, // HS_CROSS
    {0x81422418, 0x18244281}  // HS_DIAGCROSS
};

static char _DrawMode = MODE_OPAQUE;
static UINT32 _ColorKey;
static UINT32 _ColorKeyMask;

static BOOL _EnableAlpha = FALSE;
static int _AlphaKs, _AlphaKd;
static BOOL _ClipEnable = FALSE;
static BOOL _OutsideClip = FALSE;
static UINT32 _ClipTL, _ClipBR;
static int _PatternType;

static unsigned	char FontData8[256][8] =
{{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},  //0
 {0x7E,0x81,0xA5,0x81,0xBD,0x99,0x81,0x7E},  //1
 {0x7E,0xFF,0xDB,0xFF,0xC3,0xE7,0xFF,0x7E},  //2
 {0x6C,0xFE,0xFE,0xFE,0x7C,0x38,0x10,0x00},  //3
 {0x10,0x38,0x7C,0xFE,0x7C,0x38,0x10,0x00},  //4
 {0x38,0x7C,0x38,0xFE,0xFE,0x92,0x10,0x7C},  //5
 {0x00,0x10,0x38,0x7C,0xFE,0x7C,0x38,0x7C},  //6
 {0x00,0x00,0x18,0x3C,0x3C,0x18,0x00,0x00},  //7
 {0xFF,0xFF,0xE7,0xC3,0xC3,0xE7,0xFF,0xFF},  //8
 {0x00,0x3C,0x66,0x42,0x42,0x66,0x3C,0x00},  //9
 {0xFF,0xC3,0x99,0xBD,0xBD,0x99,0xC3,0xFF},  //10
 {0x0F,0x07,0x0F,0x7D,0xCC,0xCC,0xCC,0x78},  //11
 {0x3C,0x66,0x66,0x66,0x3C,0x18,0x7E,0x18},  //12
 {0x3F,0x33,0x3F,0x30,0x30,0x70,0xF0,0xE0},  //13
 {0x7F,0x63,0x7F,0x63,0x63,0x67,0xE6,0xC0},  //14
 {0x99,0x5A,0x3C,0xE7,0xE7,0x3C,0x5A,0x99},  //15
 {0x80,0xE0,0xF8,0xFE,0xF8,0xE0,0x80,0x00},  //16
 {0x02,0x0E,0x3E,0xFE,0x3E,0x0E,0x02,0x00},  //17
 {0x18,0x3C,0x7E,0x18,0x18,0x7E,0x3C,0x18},  //18
 {0x66,0x66,0x66,0x66,0x66,0x00,0x66,0x00},  //19
 {0x7F,0xDB,0xDB,0x7B,0x1B,0x1B,0x1B,0x00},  //20
 {0x3E,0x63,0x38,0x6C,0x6C,0x38,0x86,0xFC},  //21
 {0x00,0x00,0x00,0x00,0x7E,0x7E,0x7E,0x00},  //22
 {0x18,0x3C,0x7E,0x18,0x7E,0x3C,0x18,0xFF},  //23
 {0x18,0x3C,0x7E,0x18,0x18,0x18,0x18,0x00},  //24
 {0x18,0x18,0x18,0x18,0x7E,0x3C,0x18,0x00},  //25
 {0x00,0x18,0x0C,0xFE,0x0C,0x18,0x00,0x00},  //26
 {0x00,0x30,0x60,0xFE,0x60,0x30,0x00,0x00},  //27
 {0x00,0x00,0xC0,0xC0,0xC0,0xFE,0x00,0x00},  //28
 {0x00,0x24,0x66,0xFF,0x66,0x24,0x00,0x00},  //29
 {0x00,0x18,0x3C,0x7E,0xFF,0xFF,0x00,0x00},  //30
 {0x00,0xFF,0xFF,0x7E,0x3C,0x18,0x00,0x00},  //31
 {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},  //32
 {0x18,0x3C,0x3C,0x18,0x18,0x00,0x18,0x00},  //33
 {0x6C,0x6C,0x6C,0x00,0x00,0x00,0x00,0x00},  //34
 {0x6C,0x6C,0xFE,0x6C,0xFE,0x6C,0x6C,0x00},  //35
 {0x18,0x7E,0xC0,0x7C,0x06,0xFC,0x18,0x00},  //36
 {0x00,0xC6,0xCC,0x18,0x30,0x66,0xC6,0x00},  //37
 {0x38,0x6C,0x38,0x76,0xDC,0xCC,0x76,0x00},  //38
 {0x30,0x30,0x60,0x00,0x00,0x00,0x00,0x00},  //39
 {0x18,0x30,0x60,0x60,0x60,0x30,0x18,0x00},  //40
 {0x60,0x30,0x18,0x18,0x18,0x30,0x60,0x00},  //41
 {0x00,0x66,0x3C,0xFF,0x3C,0x66,0x00,0x00},  //42
 {0x00,0x18,0x18,0x7E,0x18,0x18,0x00,0x00},  //43
 {0x00,0x00,0x00,0x00,0x00,0x18,0x18,0x30},  //44
 {0x00,0x00,0x00,0x7E,0x00,0x00,0x00,0x00},  //45
 {0x00,0x00,0x00,0x00,0x00,0x18,0x18,0x00},  //46
 {0x06,0x0C,0x18,0x30,0x60,0xC0,0x80,0x00},  //47
 {0x7C,0xCE,0xDE,0xF6,0xE6,0xC6,0x7C,0x00},  //48
 {0x30,0x70,0x30,0x30,0x30,0x30,0xFC,0x00},  //49
 {0x78,0xCC,0x0C,0x38,0x60,0xCC,0xFC,0x00},  //50
 {0x78,0xCC,0x0C,0x38,0x0C,0xCC,0x78,0x00},  //51
 {0x1C,0x3C,0x6C,0xCC,0xFE,0x0C,0x1E,0x00},  //52
 {0xFC,0xC0,0xF8,0x0C,0x0C,0xCC,0x78,0x00},  //53
 {0x38,0x60,0xC0,0xF8,0xCC,0xCC,0x78,0x00},  //54
 {0xFC,0xCC,0x0C,0x18,0x30,0x30,0x30,0x00},  //55
 {0x78,0xCC,0xCC,0x78,0xCC,0xCC,0x78,0x00},  //56
 {0x78,0xCC,0xCC,0x7C,0x0C,0x18,0x70,0x00},  //57
 {0x00,0x18,0x18,0x00,0x00,0x18,0x18,0x00},  //58
 {0x00,0x18,0x18,0x00,0x00,0x18,0x18,0x30},  //59
 {0x18,0x30,0x60,0xC0,0x60,0x30,0x18,0x00},  //60
 {0x00,0x00,0x7E,0x00,0x7E,0x00,0x00,0x00},  //61
 {0x60,0x30,0x18,0x0C,0x18,0x30,0x60,0x00},  //62
 {0x3C,0x66,0x0C,0x18,0x18,0x00,0x18,0x00},  //63
 {0x7C,0xC6,0xDE,0xDE,0xDC,0xC0,0x7C,0x00},  //64
 {0x30,0x78,0xCC,0xCC,0xFC,0xCC,0xCC,0x00},  //65
 {0xFC,0x66,0x66,0x7C,0x66,0x66,0xFC,0x00},  //66
 {0x3C,0x66,0xC0,0xC0,0xC0,0x66,0x3C,0x00},  //67
 {0xF8,0x6C,0x66,0x66,0x66,0x6C,0xF8,0x00},  //68
 {0xFE,0x62,0x68,0x78,0x68,0x62,0xFE,0x00},  //69
 {0xFE,0x62,0x68,0x78,0x68,0x60,0xF0,0x00},  //70
 {0x3C,0x66,0xC0,0xC0,0xCE,0x66,0x3A,0x00},  //71
 {0xCC,0xCC,0xCC,0xFC,0xCC,0xCC,0xCC,0x00},  //72
 {0x78,0x30,0x30,0x30,0x30,0x30,0x78,0x00},  //73
 {0x1E,0x0C,0x0C,0x0C,0xCC,0xCC,0x78,0x00},  //74
 {0xE6,0x66,0x6C,0x78,0x6C,0x66,0xE6,0x00},  //75
 {0xF0,0x60,0x60,0x60,0x62,0x66,0xFE,0x00},  //76
 {0xC6,0xEE,0xFE,0xFE,0xD6,0xC6,0xC6,0x00},  //77
 {0xC6,0xE6,0xF6,0xDE,0xCE,0xC6,0xC6,0x00},  //78
 {0x38,0x6C,0xC6,0xC6,0xC6,0x6C,0x38,0x00},  //79
 {0xFC,0x66,0x66,0x7C,0x60,0x60,0xF0,0x00},  //80
 {0x7C,0xC6,0xC6,0xC6,0xD6,0x7C,0x0E,0x00},  //81
 {0xFC,0x66,0x66,0x7C,0x6C,0x66,0xE6,0x00},  //82
 {0x7C,0xC6,0xE0,0x78,0x0E,0xC6,0x7C,0x00},  //83
 {0xFC,0xB4,0x30,0x30,0x30,0x30,0x78,0x00},  //84
 {0xCC,0xCC,0xCC,0xCC,0xCC,0xCC,0xFC,0x00},  //85
 {0xCC,0xCC,0xCC,0xCC,0xCC,0x78,0x30,0x00},  //86
 {0xC6,0xC6,0xC6,0xC6,0xD6,0xFE,0x6C,0x00},  //87
 {0xC6,0xC6,0x6C,0x38,0x6C,0xC6,0xC6,0x00},  //88
 {0xCC,0xCC,0xCC,0x78,0x30,0x30,0x78,0x00},  //89
 {0xFE,0xC6,0x8C,0x18,0x32,0x66,0xFE,0x00},  //90
 {0x78,0x60,0x60,0x60,0x60,0x60,0x78,0x00},  //91
 {0xC0,0x60,0x30,0x18,0x0C,0x06,0x02,0x00},  //92
 {0x78,0x18,0x18,0x18,0x18,0x18,0x78,0x00},  //93
 {0x10,0x38,0x6C,0xC6,0x00,0x00,0x00,0x00},  //94
 {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF},  //95
 {0x30,0x30,0x18,0x00,0x00,0x00,0x00,0x00},  //96
 {0x00,0x00,0x78,0x0C,0x7C,0xCC,0x76,0x00},  //97
 {0xE0,0x60,0x60,0x7C,0x66,0x66,0xDC,0x00},  //98
 {0x00,0x00,0x78,0xCC,0xC0,0xCC,0x78,0x00},  //99
 {0x1C,0x0C,0x0C,0x7C,0xCC,0xCC,0x76,0x00},  //100
 {0x00,0x00,0x78,0xCC,0xFC,0xC0,0x78,0x00},  //101
 {0x38,0x6C,0x64,0xF0,0x60,0x60,0xF0,0x00},  //102
 {0x00,0x00,0x76,0xCC,0xCC,0x7C,0x0C,0xF8},  //103
 {0xE0,0x60,0x6C,0x76,0x66,0x66,0xE6,0x00},  //104
 {0x30,0x00,0x70,0x30,0x30,0x30,0x78,0x00},  //105
 {0x0C,0x00,0x1C,0x0C,0x0C,0xCC,0xCC,0x78},  //106
 {0xE0,0x60,0x66,0x6C,0x78,0x6C,0xE6,0x00},  //107
 {0x70,0x30,0x30,0x30,0x30,0x30,0x78,0x00},  //108
 {0x00,0x00,0xCC,0xFE,0xFE,0xD6,0xD6,0x00},  //109
 {0x00,0x00,0xB8,0xCC,0xCC,0xCC,0xCC,0x00},  //110
 {0x00,0x00,0x78,0xCC,0xCC,0xCC,0x78,0x00},  //111
 {0x00,0x00,0xDC,0x66,0x66,0x7C,0x60,0xF0},  //112
 {0x00,0x00,0x76,0xCC,0xCC,0x7C,0x0C,0x1E},  //113
 {0x00,0x00,0xDC,0x76,0x62,0x60,0xF0,0x00},  //114
 {0x00,0x00,0x7C,0xC0,0x70,0x1C,0xF8,0x00},  //115
 {0x10,0x30,0xFC,0x30,0x30,0x34,0x18,0x00},  //116
 {0x00,0x00,0xCC,0xCC,0xCC,0xCC,0x76,0x00},  //117
 {0x00,0x00,0xCC,0xCC,0xCC,0x78,0x30,0x00},  //118
 {0x00,0x00,0xC6,0xC6,0xD6,0xFE,0x6C,0x00},  //119
 {0x00,0x00,0xC6,0x6C,0x38,0x6C,0xC6,0x00},  //120
 {0x00,0x00,0xCC,0xCC,0xCC,0x7C,0x0C,0xF8},  //121
 {0x00,0x00,0xFC,0x98,0x30,0x64,0xFC,0x00},  //122
 {0x1C,0x30,0x30,0xE0,0x30,0x30,0x1C,0x00},  //123
 {0x18,0x18,0x18,0x00,0x18,0x18,0x18,0x00},  //124
 {0xE0,0x30,0x30,0x1C,0x30,0x30,0xE0,0x00},  //125
 {0x76,0xDC,0x00,0x00,0x00,0x00,0x00,0x00},  //126
 {0x00,0x10,0x38,0x6C,0xC6,0xC6,0xFE,0x00},  //127
 {0x7C,0xC6,0xC0,0xC6,0x7C,0x0C,0x06,0x7C},  //128
 {0x00,0xCC,0x00,0xCC,0xCC,0xCC,0x76,0x00},  //129
 {0x1C,0x00,0x78,0xCC,0xFC,0xC0,0x78,0x00},  //130
 {0x7E,0x81,0x3C,0x06,0x3E,0x66,0x3B,0x00},  //131
 {0xCC,0x00,0x78,0x0C,0x7C,0xCC,0x76,0x00},  //132
 {0xE0,0x00,0x78,0x0C,0x7C,0xCC,0x76,0x00},  //133
 {0x30,0x30,0x78,0x0C,0x7C,0xCC,0x76,0x00},  //134
 {0x00,0x00,0x7C,0xC6,0xC0,0x78,0x0C,0x38},  //135
 {0x7E,0x81,0x3C,0x66,0x7E,0x60,0x3C,0x00},  //136
 {0xCC,0x00,0x78,0xCC,0xFC,0xC0,0x78,0x00},  //137
 {0xE0,0x00,0x78,0xCC,0xFC,0xC0,0x78,0x00},  //138
 {0xCC,0x00,0x70,0x30,0x30,0x30,0x78,0x00},  //139
 {0x7C,0x82,0x38,0x18,0x18,0x18,0x3C,0x00},  //140
 {0xE0,0x00,0x70,0x30,0x30,0x30,0x78,0x00},  //141
 {0xC6,0x10,0x7C,0xC6,0xFE,0xC6,0xC6,0x00},  //142
 {0x30,0x30,0x00,0x78,0xCC,0xFC,0xCC,0x00},  //143
 {0x1C,0x00,0xFC,0x60,0x78,0x60,0xFC,0x00},  //144
 {0x00,0x00,0x7F,0x0C,0x7F,0xCC,0x7F,0x00},  //145
 {0x3E,0x6C,0xCC,0xFE,0xCC,0xCC,0xCE,0x00},  //146
 {0x78,0x84,0x00,0x78,0xCC,0xCC,0x78,0x00},  //147
 {0x00,0xCC,0x00,0x78,0xCC,0xCC,0x78,0x00},  //148
 {0x00,0xE0,0x00,0x78,0xCC,0xCC,0x78,0x00},  //149
 {0x78,0x84,0x00,0xCC,0xCC,0xCC,0x76,0x00},  //150
 {0x00,0xE0,0x00,0xCC,0xCC,0xCC,0x76,0x00},  //151
 {0x00,0xCC,0x00,0xCC,0xCC,0x7C,0x0C,0xF8},  //152
 {0xC3,0x18,0x3C,0x66,0x66,0x3C,0x18,0x00},  //153
 {0xCC,0x00,0xCC,0xCC,0xCC,0xCC,0x78,0x00},  //154
 {0x18,0x18,0x7E,0xC0,0xC0,0x7E,0x18,0x18},  //155
 {0x38,0x6C,0x64,0xF0,0x60,0xE6,0xFC,0x00},  //156
 {0xCC,0xCC,0x78,0x30,0xFC,0x30,0xFC,0x30},  //157
 {0xF8,0xCC,0xCC,0xFA,0xC6,0xCF,0xC6,0xC3},  //158
 {0x0E,0x1B,0x18,0x3C,0x18,0x18,0xD8,0x70},  //159
 {0x1C,0x00,0x78,0x0C,0x7C,0xCC,0x76,0x00},  //160
 {0x38,0x00,0x70,0x30,0x30,0x30,0x78,0x00},  //161
 {0x00,0x1C,0x00,0x78,0xCC,0xCC,0x78,0x00},  //162
 {0x00,0x1C,0x00,0xCC,0xCC,0xCC,0x76,0x00},  //163
 {0x00,0xF8,0x00,0xB8,0xCC,0xCC,0xCC,0x00},  //164
 {0xFC,0x00,0xCC,0xEC,0xFC,0xDC,0xCC,0x00},  //165
 {0x3C,0x6C,0x6C,0x3E,0x00,0x7E,0x00,0x00},  //166
 {0x38,0x6C,0x6C,0x38,0x00,0x7C,0x00,0x00},  //167
 {0x18,0x00,0x18,0x18,0x30,0x66,0x3C,0x00},  //168
 {0x00,0x00,0x00,0xFC,0xC0,0xC0,0x00,0x00},  //169
 {0x00,0x00,0x00,0xFC,0x0C,0x0C,0x00,0x00},  //170
 {0xC6,0xCC,0xD8,0x36,0x6B,0xC2,0x84,0x0F},  //171
 {0xC3,0xC6,0xCC,0xDB,0x37,0x6D,0xCF,0x03},  //172
 {0x18,0x00,0x18,0x18,0x3C,0x3C,0x18,0x00},  //173
 {0x00,0x33,0x66,0xCC,0x66,0x33,0x00,0x00},  //174
 {0x00,0xCC,0x66,0x33,0x66,0xCC,0x00,0x00},  //175
 {0x22,0x88,0x22,0x88,0x22,0x88,0x22,0x88},  //176
 {0x55,0xAA,0x55,0xAA,0x55,0xAA,0x55,0xAA},  //177
 {0xDB,0xF6,0xDB,0x6F,0xDB,0x7E,0xD7,0xED},  //178
 {0x18,0x18,0x18,0x18,0x18,0x18,0x18,0x18},  //179
 {0x18,0x18,0x18,0x18,0xF8,0x18,0x18,0x18},  //180
 {0x18,0x18,0xF8,0x18,0xF8,0x18,0x18,0x18},  //181
 {0x36,0x36,0x36,0x36,0xF6,0x36,0x36,0x36},  //182
 {0x00,0x00,0x00,0x00,0xFE,0x36,0x36,0x36},  //183
 {0x00,0x00,0xF8,0x18,0xF8,0x18,0x18,0x18},  //184
 {0x36,0x36,0xF6,0x06,0xF6,0x36,0x36,0x36},  //185
 {0x36,0x36,0x36,0x36,0x36,0x36,0x36,0x36},  //186
 {0x00,0x00,0xFE,0x06,0xF6,0x36,0x36,0x36},  //187
 {0x36,0x36,0xF6,0x06,0xFE,0x00,0x00,0x00},  //188
 {0x36,0x36,0x36,0x36,0xFE,0x00,0x00,0x00},  //189
 {0x18,0x18,0xF8,0x18,0xF8,0x00,0x00,0x00},  //190
 {0x00,0x00,0x00,0x00,0xF8,0x18,0x18,0x18},  //191
 {0x18,0x18,0x18,0x18,0x1F,0x00,0x00,0x00},  //192
 {0x18,0x18,0x18,0x18,0xFF,0x00,0x00,0x00},  //193
 {0x00,0x00,0x00,0x00,0xFF,0x18,0x18,0x18},  //194
 {0x18,0x18,0x18,0x18,0x1F,0x18,0x18,0x18},  //195
 {0x00,0x00,0x00,0x00,0xFF,0x00,0x00,0x00},  //196
 {0x18,0x18,0x18,0x18,0xFF,0x18,0x18,0x18},  //197
 {0x18,0x18,0x1F,0x18,0x1F,0x18,0x18,0x18},  //198
 {0x36,0x36,0x36,0x36,0x37,0x36,0x36,0x36},  //199
 {0x36,0x36,0x37,0x30,0x3F,0x00,0x00,0x00},  //200
 {0x00,0x00,0x3F,0x30,0x37,0x36,0x36,0x36},  //201
 {0x36,0x36,0xF7,0x00,0xFF,0x00,0x00,0x00},  //202
 {0x00,0x00,0xFF,0x00,0xF7,0x36,0x36,0x36},  //203
 {0x36,0x36,0x37,0x30,0x37,0x36,0x36,0x36},  //204
 {0x00,0x00,0xFF,0x00,0xFF,0x00,0x00,0x00},  //205
 {0x36,0x36,0xF7,0x00,0xF7,0x36,0x36,0x36},  //206
 {0x18,0x18,0xFF,0x00,0xFF,0x00,0x00,0x00},  //207
 {0x36,0x36,0x36,0x36,0xFF,0x00,0x00,0x00},  //208
 {0x00,0x00,0xFF,0x00,0xFF,0x18,0x18,0x18},  //209
 {0x00,0x00,0x00,0x00,0xFF,0x36,0x36,0x36},  //210
 {0x36,0x36,0x36,0x36,0x3F,0x00,0x00,0x00},  //211
 {0x18,0x18,0x1F,0x18,0x1F,0x00,0x00,0x00},  //212
 {0x00,0x00,0x1F,0x18,0x1F,0x18,0x18,0x18},  //213
 {0x00,0x00,0x00,0x00,0x3F,0x36,0x36,0x36},  //214
 {0x36,0x36,0x36,0x36,0xFF,0x36,0x36,0x36},  //215
 {0x18,0x18,0xFF,0x18,0xFF,0x18,0x18,0x18},  //216
 {0x18,0x18,0x18,0x18,0xF8,0x00,0x00,0x00},  //217
 {0x00,0x00,0x00,0x00,0x1F,0x18,0x18,0x18},  //218
 {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF},  //219
 {0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF},  //220
 {0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0,0xF0},  //221
 {0x0F,0x0F,0x0F,0x0F,0x0F,0x0F,0x0F,0x0F},  //222
 {0xFF,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00},  //223
 {0x00,0x00,0x76,0xDC,0xC8,0xDC,0x76,0x00},  //224
 {0x00,0x78,0xCC,0xF8,0xCC,0xF8,0xC0,0xC0},  //225
 {0x00,0xFC,0xCC,0xC0,0xC0,0xC0,0xC0,0x00},  //226
 {0x00,0x00,0xFE,0x6C,0x6C,0x6C,0x6C,0x00},  //227
 {0xFC,0xCC,0x60,0x30,0x60,0xCC,0xFC,0x00},  //228
 {0x00,0x00,0x7E,0xD8,0xD8,0xD8,0x70,0x00},  //229
 {0x00,0x66,0x66,0x66,0x66,0x7C,0x60,0xC0},  //230
 {0x00,0x76,0xDC,0x18,0x18,0x18,0x18,0x00},  //231
 {0xFC,0x30,0x78,0xCC,0xCC,0x78,0x30,0xFC},  //232
 {0x38,0x6C,0xC6,0xFE,0xC6,0x6C,0x38,0x00},  //233
 {0x38,0x6C,0xC6,0xC6,0x6C,0x6C,0xEE,0x00},  //234
 {0x1C,0x30,0x18,0x7C,0xCC,0xCC,0x78,0x00},  //235
 {0x00,0x00,0x7E,0xDB,0xDB,0x7E,0x00,0x00},  //236
 {0x06,0x0C,0x7E,0xDB,0xDB,0x7E,0x60,0xC0},  //237
 {0x38,0x60,0xC0,0xF8,0xC0,0x60,0x38,0x00},  //238
 {0x78,0xCC,0xCC,0xCC,0xCC,0xCC,0xCC,0x00},  //239
 {0x00,0x7E,0x00,0x7E,0x00,0x7E,0x00,0x00},  //240
 {0x18,0x18,0x7E,0x18,0x18,0x00,0x7E,0x00},  //241
 {0x60,0x30,0x18,0x30,0x60,0x00,0xFC,0x00},  //242
 {0x18,0x30,0x60,0x30,0x18,0x00,0xFC,0x00},  //243
 {0x0E,0x1B,0x1B,0x18,0x18,0x18,0x18,0x18},  //244
 {0x18,0x18,0x18,0x18,0x18,0xD8,0xD8,0x70},  //245
 {0x18,0x18,0x00,0x7E,0x00,0x18,0x18,0x00},  //246
 {0x00,0x76,0xDC,0x00,0x76,0xDC,0x00,0x00},  //247
 {0x38,0x6C,0x6C,0x38,0x00,0x00,0x00,0x00},  //248
 {0x00,0x00,0x00,0x18,0x18,0x00,0x00,0x00},  //249
 {0x00,0x00,0x00,0x00,0x18,0x00,0x00,0x00},  //250
 {0x0F,0x0C,0x0C,0x0C,0xEC,0x6C,0x3C,0x1C},  //251
 {0x58,0x6C,0x6C,0x6C,0x6C,0x00,0x00,0x00},  //252
 {0x70,0x98,0x30,0x60,0xF8,0x00,0x00,0x00},  //253
 {0x00,0x00,0x3C,0x3C,0x3C,0x3C,0x00,0x00},  //254
 {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}   //255
};

